In [1]:
import pandas as pd

In [131]:
left_df = pd.read_csv('temp_original.csv')
left_df = left_df.drop('year', axis=1)
right_df = pd.read_csv('temp_S0201.csv')

In [132]:
left_df.head()

                                 MSA
0                          Akron, OH
1        Albany-Schenectady-Troy, NY
2  Allentown-Bethlehem-Easton, PA-NJ
3                        Altoona, PA
4       Anaheim-Santa Ana-Irvine, CA

In [133]:
left_df.shape[0]

46247

In [134]:
right_df.shape[0]

114

In [135]:
right_df.head()

,MSA,num_races,household_size,frac_married,frac_school,frac_college,frac_educated,annual_births,frac_veteran,frac_disability,non_citizen,employment_rate,frac_priv_insurance,frac_mcare_insurance,frac_no_insurance,poverty_rate
0,"Akron, OH",3,2.34,0.46,0.72,0.24,0.92,"160,665",0.06,0.14,0.40,0.63,0.68,0.40,0.06,0.09
1,"Albany-Schenectady-Troy, NY",3,2.29,0.47,0.66,0.30,0.93,"208,912",0.06,0.13,0.38,0.63,0.74,0.38,0.03,0.07
2,"Albuquerque, NM",4,2.42,0.45,0.72,0.23,0.90,"215,515",0.08,0.15,0.49,0.60,0.60,0.46,0.09,0.11
3,"Allentown-Bethlehem-Easton, PA-NJ",4,2.50,0.49,0.71,0.24,0.91,"191,596",0.06,0.13,0.42,0.64,0.72,0.37,0.06,0.08
4,"Atlanta-Sandy Springs-Alpharetta, GA",4,2.66,0.48,0.72,0.22,0.91,"1,573,561",0.07,0.11,0.48,0.67,0.70,0.28,0.12,0.09

In [136]:
new_df = left_df.merge(right_df, how='left')#, on='MSA')#, validate='many_to_many')

In [137]:
# df = pd.merge(left_df, right_df, on=['MSA'], how="outer", indicator=True)
# df = df[df['_merge'] == 'right_only']
# df = df.drop('_merge', axis=1)

In [138]:
new_df.head()

,MSA,num_races,household_size,frac_married,frac_school,frac_college,frac_educated,annual_births,frac_veteran,frac_disability,non_citizen,employment_rate,frac_priv_insurance,frac_mcare_insurance,frac_no_insurance,poverty_rate
0,"Akron, OH",3.0,2.34,0.46,0.72,0.24,0.92,"160,665",0.06,0.14,0.40,0.63,0.68,0.40,0.06,0.09
1,"Albany-Schenectady-Troy, NY",3.0,2.29,0.47,0.66,0.30,0.93,"208,912",0.06,0.13,0.38,0.63,0.74,0.38,0.03,0.07
2,"Allentown-Bethlehem-Easton, PA-NJ",4.0,2.50,0.49,0.71,0.24,0.91,"191,596",0.06,0.13,0.42,0.64,0.72,0.37,0.06,0.08
3,"Altoona, PA",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"Anaheim-Santa Ana-Irvine, CA",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [139]:
new_df.shape[0]

46247

In [140]:
left_df.shape[0]

46247

In [141]:
new_df.to_csv('joined_S0201.csv')